TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::writeLongBytes(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, int32_t _writeVal[], const size_t _len){
    uint8_t statusByte = 0xFF;

    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _writeByte;

    for(size_t i = 0; i < _len; i++){
        for(uint8_t shift = 24; shift >= 0; shift -=8){
            while(!(UCB0IFG & UCTXIFG));
            UCB0TXBUF = (uint8_t)(_writeVal[i] >> shift);
        }
    }

    while (UCB0CTLW0 & UCTXSTT);
    UCB0CTLW0 |= UCTXSTP;
    while (UCB0CTLW0 & UCTXSTP);

    __delay_cycles(2000);           // 2ms delay @ 1MHz

    // read status bytes
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;
    UCB0CTLW0 |= UCTXSTP;           // set stop

    while(!(UCB0IFG & UCRXIFG));
    statusByte = UCB0RXBUF;

    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::writeBytes(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, uint8_t _writeVal[], const size_t _len){
    uint8_t statusByte = 0xFF;

    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _writeByte;

    for(size_t i = 0; i < _len; i++){
        while(!(UCB0IFG & UCTXIFG));
        UCB0TXBUF = _writeVal[i];
    }

    while (UCB0CTLW0 & UCTXSTT);
    UCB0CTLW0 |= UCTXSTP;
    while (UCB0CTLW0 & UCTXSTP);

    __delay_cycles(2000);           // 2ms delay @ 1MHz

    // read status bytes
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;
    UCB0CTLW0 |= UCTXSTP;           // set stop

    while(!(UCB0IFG & UCRXIFG));
    statusByte = UCB0RXBUF;

    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::readByte(uint8_t _familyByte, uint8_t _indexByte){

    uint8_t returnByte = 0xFF;
    uint8_t statusByte = 0x00;

    // write the family & index byte
    UCB0I2CSA = _address;           // set slave address
    UCB0CTLW0 |= UCTR | UCTXSTT;    // transmitter mode & start condition

    while(!(UCB0IFG & UCTXIFG));    // wait for tx buffer
    UCB0TXBUF = _familyByte;        // send family byte

    while(!(UCB0IFG & UCTXIFG));    // wait for tx buffer
    UCB0TXBUF = _indexByte;         // send family byte

    while(UCB0CTLW0 & UCTXSTT);     // wait for start bit to clear
    UCB0CTLW0 |= UCTXSTP;           // generate stop condition
    while(UCB0CTLW0 & UCTXSTP);     // wait for stop to finish

    __delay_cycles(2000);           // 2ms delay @ 1MHz

    // read back status bit
    UCB0CTLW0 &= ~UCTR;             // receiver mode
    UCB0CTLW0 |= UCTXSTT;           // start condition

    // read status byte
    while(!(UCB0IFG & UCTXIFG));    // wait until interrupt
    statusByte = UCB0RXBUF;

    // read return byte
    UCB0CTLW0 |= UCTXSTP;           // set stop before reading the last byte
    while(!(UCB0IFG & UCTXIFG));    // wait until interrupt
    returnByte = UCB0RXBUF;

    while(UCB0CTLW0 & UCTXSTP);     // wait for stop to finish

    // check if the statusByte isn't 0x00 to return the error

    if(statusByte != SFE_BIO_SUCCESS){
        return statusByte;
    }

    return returnByte;
}

// similar to above, but we just add the write
uint8_t SparkFun_Bio_Sensor_Hub::readByte(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte){
    uint8_t statusByte = 0xFF;
    uint8_t returnByte = 0x00;

    // write the three bytes
    UCB0I2CSA = this->_address;
    UCB0CTLW0 = UCTR | UCTXSTT;

    while(!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;

    while(!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;

    while(!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _writeByte;

    while(UCB0CTLW0 & UCTXSTT);     // wait for start bit to clear
    UCB0CTLW0 |= UCTXSTP;           // generate stop condition
    while(UCB0CTLW0 & UCTXSTP);     // wait for stop to finish

    __delay_cycles(2000);           // 2ms delay @ 1MHz

    // read the status + data
    UCB0CTLW0 &= ~UCTR;             // receiver mode
    UCB0CTLW0 |= UCTXSTT;           // start condition

    // read status byte
    while(!(UCB0IFG & UCTXIFG));    // wait until interrupt
    statusByte = UCB0RXBUF;

    // read return byte
    UCB0CTLW0 |= UCTXSTP;           // set stop before reading the last byte
    while(!(UCB0IFG & UCTXIFG));    // wait until interrupt
    returnByte = UCB0RXBUF;

    while(UCB0CTLW0 & UCTXSTP);     // wait for stop to finish

    // check if the statusByte isn't 0x00 to return the error

    if(statusByte != SFE_BIO_SUCCESS){
        return statusByte;
    }

    return returnByte;
}

uint16_t SparkFun_Bio_Sensor_Hub::readIntByte(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte){
    uint16_t returnVal = 0;
    uint8_t statusByte = 0xFF;

    // write the three bytes
    UCB0I2CSA = this->_address;
    UCB0CTLW0 = UCTR | UCTXSTT;

    while(!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _familyByte;

    while(!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _indexByte;

    while(!(UCB0IFG & UCTXIFG));
    UCB0TXBUF = _writeByte;

    while(UCB0CTLW0 & UCTXSTT);     // wait for start bit to clear
    UCB0CTLW0 |= UCTXSTP;           // generate stop condition
    while(UCB0CTLW0 & UCTXSTP);     // wait for stop to finish

    __delay_cycles(2000);           // 2ms delay @ 1MHz

    // read the status + data
    UCB0CTLW0 &= ~UCTR;             // receiver mode
    UCB0CTLW0 |= UCTXSTT;           // start condition

    // read status byte
    while(!(UCB0IFG & UCTXIFG));    // wait until interrupt
    statusByte = UCB0RXBUF;

    // check for an error
    if(statusByte != SFE_BIO_SUCCESS){
        UCB0CTLW0 |= UCTXSTP;
        return 0;
    }

    // read high byte
    while(!(UCB0IFG & UCRXIFG));
    returnVal = (uint16_t)UCB0RXBUF << 8;

    // read low byte
    UCB0CTLW0 |= UCTXSTP;
    while(!(UCB0IFG & UCRXIFG));
    returnVal |= UCB0RXBUF

    while(UCB0CTLW0 & UCTXSTP);

    return returnVal;
}

